In [3]:
import pandas as pd

In [35]:
airports = pd.DataFrame([
    ["Soekarno-Hatta", "Jakarta", "Indonesia"],
    ["Sabiha-Gokcen", "Istanbul", "Turki"],
    ["SSQ 2", "Pekanbaru", "Indonesia"],
    ["Adi-Sutjipto", "Yogyakarta", "Indonesia"],
    ["MinangKabau", "Padang", "Indonesia"],
    ["Haneda", "Tokyo", "Japan"],
    ["Narita", "Tokyo", "Japan"]],
    columns=["Name", "City", "Country"]
)

# Head - First n rows
- default n=5

In [36]:
print(airports.head(3))

             Name       City    Country
0  Soekarno-Hatta    Jakarta  Indonesia
1   Sabiha-Gokcen   Istanbul      Turki
2           SSQ 2  Pekanbaru  Indonesia

# Tail - last n rows
- default n=5

In [37]:
print(airports.tail(3))

          Name    City    Country
4  MinangKabau  Padang  Indonesia
5       Haneda   Tokyo      Japan
6       Narita   Tokyo      Japan

# Shape - return number of rows & number of columns

In [38]:
airports.shape

(7, 3)

# Info - return more detail inormation

In [39]:
airports.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     7 non-null      object
 1   City     7 non-null      object
 2   Country  7 non-null      object
dtypes: object(3)
memory usage: 296.0+ bytes

# Return One Column

In [40]:
airports["City"]

0       Jakarta
1      Istanbul
2     Pekanbaru
3    Yogyakarta
4        Padang
5         Tokyo
6         Tokyo
Name: City, dtype: object

# Return multiple column

In [41]:
airports[["City", "Country"]]

         City    Country
0     Jakarta  Indonesia
1    Istanbul      Turki
2   Pekanbaru  Indonesia
3  Yogyakarta  Indonesia
4      Padang  Indonesia
5       Tokyo      Japan
6       Tokyo      Japan

# Using iLoc to specify rows and column to return

In [42]:
airports.iloc[0,0]

'Soekarno-Hatta'

In [43]:
# return all rows and columns
airports.iloc[:,:]

             Name        City    Country
0  Soekarno-Hatta     Jakarta  Indonesia
1   Sabiha-Gokcen    Istanbul      Turki
2           SSQ 2   Pekanbaru  Indonesia
3    Adi-Sutjipto  Yogyakarta  Indonesia
4     MinangKabau      Padang  Indonesia
5          Haneda       Tokyo      Japan
6          Narita       Tokyo      Japan

In [44]:
# display the first 2 row and all columns
airports.iloc[0:2, :]

             Name      City    Country
0  Soekarno-Hatta   Jakarta  Indonesia
1   Sabiha-Gokcen  Istanbul      Turki

In [45]:
# display all rows and only the first 2 column

airports.iloc[:, 0:2]

             Name        City
0  Soekarno-Hatta     Jakarta
1   Sabiha-Gokcen    Istanbul
2           SSQ 2   Pekanbaru
3    Adi-Sutjipto  Yogyakarta
4     MinangKabau      Padang
5          Haneda       Tokyo
6          Narita       Tokyo

In [46]:
# display all rows and column 0 and 2

# airports.iloc[:, [0,2]]
airports.loc[:, ["Name", "Country"]]

             Name    Country
0  Soekarno-Hatta  Indonesia
1   Sabiha-Gokcen      Turki
2           SSQ 2  Indonesia
3    Adi-Sutjipto  Indonesia
4     MinangKabau  Indonesia
5          Haneda      Japan
6          Narita      Japan

In [50]:
df = pd.read_csv("data/airports.csv")

In [51]:
print(df.head(6))

             Name       City    Country
0  Soekarno Hatta    Jakarta  Indonesia
1   Sabiha Gokcen   Istanbul     Turkey
2             SSQ  Pekanbaru  Indonesia
3     Minangkabau     Padang  Indonesia
4          Haneda      Tokyo      Japan
5          Narita      Tokyo      Japan